import os
import discord
from discord.ext import commands, tasks
from datetime import datetime
from dotenv import load_dotenv
from flask import Flask
from threading import Thread
import pytz

load_dotenv()
TOKEN = os.getenv("TOKEN")
CHANNEL_ID = int(os.getenv("CHANNEL_ID"))

intents = discord.Intents.default()
bot = commands.Bot(command_prefix="!", intents=intents)

tz = pytz.timezone("Asia/Bangkok")

# ---------------------- Flask ----------------------
app = Flask(__name__)

@app.route('/')
def index():
    return "Bot is alive!"  # 👈 Keyword ที่ uptime robot จะตรวจ

def run():
    app.run(host='0.0.0.0', port=int(os.environ.get("PORT", 8080)))

def keep_alive():
    t = Thread(target=run)
    t.start()

# ---------------------------------------------------

weekly_schedule = {
    "daily": {
      "00:50": "🛌💤 ดึกแค่ไหนก็ต้องพร้อม! เตรียมตัวลง วัลฮัลลา กันน้าาา 🌌 @everyone",
      "02:50": "หลับกันยังเอ่ย ! 💢 ไปอัด บอสกราม 💀 แล้วต่อ บอสบัลเดอร์ ⚔️ @everyone",
      "03:50": "💤 ถ้ายังไหว เตรียมตัวลง วัลฮัลลา กันน้าาา 💀🔮 @everyone",
      "18:50": "🚨พับเพียบรวมตัว 💥 ไปอัด บอสกราม 💀 ต่อด้วยซัด บอสบัลเดอร์ ⚔️ @everyone",
      "19:50": "⚔️ เตรียมตัวลง วัลฮัลลา กันน้าาา 🛡️✨ @everyone",
    },
    6: {
      "12:00": "⏰ แจ้งเตือนกันลืม! วันนี้มี ดันกิลด์ ตอนสามทุ่มนะคับผม 🏰🔥 @everyone",
      "18:50": "🚨พับเพียบรวมตัว 💥 ไปอัด บอสกราม 💀 ต่อด้วยซัด บอสบัลเดอร์ ⚔️ @everyone",
      "19:50": "⚔️ เตรียมตัวลง วัลฮัลลา กันน้าาา 🛡️✨ @everyone",
      "20:30": "📣 อีก 30 นาที จะลง ดันกิลด์ แล้ววว! เตรียมตัวให้พร้อมนะคะ 💪 @everyone",
      "20:55": "🚨 ใครยังไม่เข้าห้องเสียง มาด่วน!! 🎧 ดันกิลด์ จะเริ่มแล้วค่ะ ⚔️👑 @everyone",
      "00:50": "🛌💤 ดึกแค่ไหนก็ต้องพร้อม! เตรียมตัวลง วัลฮัลลา กันน้าาา 🌌 @everyone",
      "02:50": "หลับกันยังเอ่ย ! 💢 ไปอัด บอสกราม 💀 แล้วต่อ บอสบัลเดอร์ ⚔️ @everyone",
      "03:50": "💤 ถ้ายังไหว เตรียมตัวลง วัลฮัลลา กันน้าาา 💀🔮 @everyone",
    }
}

@bot.event
async def on_ready():
    print(f"✅ Logged in as {bot.user}")
    send_message.start()

@tasks.loop(seconds=60)
async def send_message():
    now = datetime.now(tz)
    time_now = now.strftime('%H:%M')
    weekday = now.weekday()

    messages = []

    if time_now in weekly_schedule["daily"]:
        messages.append(weekly_schedule["daily"][time_now])

    if weekday in weekly_schedule and time_now in weekly_schedule[weekday]:
        messages.append(weekly_schedule[weekday][time_now])

    if messages:
        channel = bot.get_channel(CHANNEL_ID)
        if channel:
            for msg in messages:
                await channel.send(msg)

# ---- เรียกทั้ง Flask + Bot ----
keep_alive()
bot.run(TOKEN)
